{"keras_version": "2.1.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "name": "conv2d_1", "bias_regularizer": null, "batch_input_shape": [null, 50, 50, 3], "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "filters": 32, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "name": "conv2d_2", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "filters": 64, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "name": "conv2d_3", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "filters": 128, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_4", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 114, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "softmax", "kernel_regularizer": null}}], "backend": "tensorflow"}