{"config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "batch_input_shape": [null, 50, 50, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dtype": "float32", "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_1"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "filters": 64, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "padding": "same", "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "filters": 128, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "padding": "same", "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_3"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_4"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 11, "activity_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "use_bias": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null}}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5"}