{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "filters": 32, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "batch_input_shape": [null, 50, 50, 3], "dtype": "float32"}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "filters": 64, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "strides": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "filters": 128, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "strides": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_4"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 11, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}}}]}