{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"config": {"filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 50, 50, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "linear", "use_bias": true, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "padding": "same", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_1", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_2", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_3", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "bias_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "leaky_re_lu_4", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 11, "bias_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}